import img1 from "../../img/5eae534f844dcd1dca347b23e18a3072.png"
import img2 from "../../img/74cf69e66698699d5f8005e47ebe20ad.png"
import img3 from "../../img/ca655227996c2a0c7318f8fdb0b29192.png"
import feedback_img1 from "../../img/65112552 1.png"
import feedback_img2 from "../../img/65112552 2.png"
import project_DropShop from "../../img/Projects/DropShop.png"
import project_FinMarket from "../../img/Projects/FinMarket.png"
import project_LeKover from "../../img/Projects/LeKover.png"
import project_UFEX from "../../img/Projects/UFEX.png"
import project_Poteryashka from "../../img/Projects/Потеряшка.png"
import avatar_bob228 from "../../img/avatars/bob228.png"
import avatar_booker from "../../img/avatars/booker.png"
import avatar_evenych from "../../img/avatars/evenych.png"
import avatar_rose from "../../img/avatars/rose.png"
import avatar_trex from "../../img/avatars/trex.png"
import photo from "../../img/Frame 36135802.png"




import Lights from "../Light/Lights"
import Preview from '../Preview/Preview';


import Text from "./Elements/Text";

//import WOW from '../Wow/wow'


import './Content.css';
import FaqBlock from "./Elements/FaqBlock"
import Card from "./Elements/Card"
import Project from "./Elements/Project"

function Content() {
    return (
        <div className="content">
            <Preview />
            <div className="company_info block">
                <div className="photo">
                    <img src={photo} alt="Photo" />
                </div>
                <div className="info">
                    <div className="">
                        <p className="title">itcredo.</p>
                    </div>
                    <p className="experience_title">специалисты по информационным технологиям и предоставляющие широкий спектр услуг для бизнеса, таких как разработка программного обеспечения, создание мобильных приложений, систем и использование искусственного интеллекта.</p>
                    <div className="experience">
                        <Text big={"30+"} size_b={"35px"} small={"реализованных проектов"} size_s={"16px"} />
                        <Text big={"5+"} size_b={"35px"} small={"лет опыта команды"} size_s={"16px"} />
                    </div>
                    <div className="ceo">
                        <svg xmlns="http://www.w3.org/2000/svg" width="44" height="44" viewBox="0 0 44 44" fill="none">
                            <circle cx="21.9998" cy="11.0003" r="7.33333" stroke="white" stroke-width="1.5" />
                            <ellipse opacity="0.5" cx="21.9998" cy="31.1663" rx="12.8333" ry="7.33333" stroke="white" stroke-width="1.5" />
                        </svg>
                        <Text big={"Дмитрий Казмирчук"} size_b={"18px"} fontWeight_b={"700"} small={"Руководитель компании и CEO"} size_s={"16px"} />
                    </div>
                </div>
            </div>
            <div id="services" className="services block ">
                <p className="title start">Услуги</p>
                <p className="title_text start">создайте инновации с нашими возможностями</p>
                <div className="cards">
                    <Card img={img1} text={<Text big={"Разработка ПО"} size_b={"24px"} gap={"10px"} small={"Индивидуальная разработка ПО, чтобы вывести ваш бизнес на новый уровень. Мы предлагаем полный спектр услуг, от концепции до кода и поддержки."} size_s={"16px"} />} />
                    <Card img={img1} text={<Text big={"Приложения"} size_b={"24px"} gap={"10px"} small={"Ваши идеи заслуживают лучшего воплощения. Мы разрабатываем мобильные и веб-приложения, которые привлекают пользователей и продвигают ваш бренд."} size_s={"16px"} />} />
                    <Card img={img2} text={<Text big={"Digital-системы"} size_b={"24px"} gap={"10px"} small={"Интегрируйте ваш бизнес с современными цифровыми системами. Автоматизация, аналитика и многое другое для увеличения эффективности и оптимизации управления."} size_s={"16px"} />} />
                    <Card img={img3} text={<Text big={"Нейронные сети"} size_b={"24px"} gap={"10px"} small={"Революционные нейронные сети для решения сложнейших задач. Искусственный интеллект, который помогает вашему бизнесу оставаться на переднем крае инноваций."} size_s={"16px"} />} />
                </div>
            </div>
            <div className="work_stages block">
                <p className="title">Этапы работы</p>
                <p className="title_text">это наши работы, мы любим когда вы их смотрите, что бы узнать нас получше!</p>
                <div className="stages">
                    <div className="stage">
                        <svg width="64" height="65" viewBox="0 0 64 65" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M23.4233 59.2269C18.9294 57.2213 15.2176 54.0959 12.7778 49.9121" stroke="#3C8AFF" stroke-width="1.5" stroke-linecap="round" />
                            <path d="M39.5337 6.38943C44.0053 5.11707 48.6219 6.32836 51.8445 9.61954" stroke="#3C8AFF" stroke-width="1.5" stroke-linecap="round" />
                            <path d="M10.6949 22.8713L10.3228 22.2202L10.6949 22.8713ZM17.3391 24.207L17.987 23.8292L17.3391 24.207ZM8.54079 29.2354L7.8929 29.6132H7.8929L8.54079 29.2354ZM20.5249 9.55396L21.1728 9.17615V9.17615L20.5249 9.55396ZM22.77 13.4038L22.1221 13.7817L22.77 13.4038ZM28.8572 25.3313C29.0658 25.6891 29.525 25.81 29.8829 25.6014C30.2407 25.3927 30.3616 24.9335 30.1529 24.5757L28.8572 25.3313ZM21.1813 32.2846C21.39 32.6424 21.8492 32.7633 22.207 32.5547C22.5648 32.346 22.6857 31.8868 22.4771 31.529L21.1813 32.2846ZM11.7266 14.5823L11.0787 14.9601L11.7266 14.5823ZM31.5683 8.37548L32.2162 7.99767V7.99767L31.5683 8.37548ZM38.3034 19.9251L38.9513 19.5473L38.3034 19.9251ZM42.7935 27.6249L43.1656 28.2761C43.3393 28.1768 43.4661 28.0123 43.5179 27.819C43.5697 27.6258 43.5421 27.4199 43.4413 27.2471L42.7935 27.6249ZM47.1018 14.8968L46.4539 15.2746L47.1018 14.8968ZM53.8368 26.4464L54.4847 26.0686L53.8368 26.4464ZM18.6434 46.5599L19.2913 46.1821L18.6434 46.5599ZM45.2202 51.9027L44.8481 51.2515L45.2202 51.9027ZM37.8373 40.7308C38.0459 41.0887 38.5051 41.2096 38.863 41.0009C39.2208 40.7923 39.3417 40.333 39.133 39.9752L37.8373 40.7308ZM11.0671 23.5225C13.2193 22.2925 15.7023 22.8889 16.6913 24.5848L17.987 23.8292C16.4962 21.2727 13.0298 20.6731 10.3228 22.2202L11.0671 23.5225ZM10.3228 22.2202C7.61345 23.7686 6.39838 27.0503 7.8929 29.6132L9.18868 28.8576C8.20341 27.168 8.91723 24.7512 11.0671 23.5225L10.3228 22.2202ZM19.877 9.93177L22.1221 13.7817L23.4178 13.026L21.1728 9.17615L19.877 9.93177ZM22.1221 13.7817L28.8572 25.3313L30.1529 24.5757L23.4178 13.026L22.1221 13.7817ZM22.4771 31.529L17.987 23.8292L16.6913 24.5848L21.1813 32.2846L22.4771 31.529ZM17.987 23.8292L12.3745 14.2045L11.0787 14.9601L16.6913 24.5848L17.987 23.8292ZM14.2529 8.86942C16.405 7.63943 18.8881 8.2358 19.877 9.93177L21.1728 9.17615C19.682 6.61966 16.2156 6.02001 13.5086 7.5671L14.2529 8.86942ZM13.5086 7.5671C10.7992 9.11553 9.58417 12.3973 11.0787 14.9601L12.3745 14.2045C11.3892 12.5149 12.103 10.0981 14.2529 8.86942L13.5086 7.5671ZM30.9204 8.75329L37.6555 20.3029L38.9513 19.5473L32.2162 7.99767L30.9204 8.75329ZM37.6555 20.3029L42.1456 28.0027L43.4413 27.2471L38.9513 19.5473L37.6555 20.3029ZM25.2963 7.69094C27.4484 6.46095 29.9314 7.05732 30.9204 8.75329L32.2162 7.99767C30.7254 5.44118 27.259 4.84153 24.552 6.38862L25.2963 7.69094ZM24.552 6.38862C21.8426 7.93704 20.6275 11.2188 22.1221 13.7817L23.4178 13.026C22.4326 11.3365 23.1464 8.91961 25.2963 7.69094L24.552 6.38862ZM46.4539 15.2746L53.1889 26.8242L54.4847 26.0686L47.7496 14.519L46.4539 15.2746ZM40.8297 14.2122C42.9819 12.9822 45.4649 13.5786 46.4539 15.2746L47.7496 14.519C46.2588 11.9625 42.7924 11.3628 40.0854 12.9099L40.8297 14.2122ZM40.0854 12.9099C37.3761 14.4583 36.161 17.7401 37.6555 20.3029L38.9513 19.5473C37.966 17.8577 38.6798 15.4409 40.8297 14.2122L40.0854 12.9099ZM7.8929 29.6132L17.9955 46.9377L19.2913 46.1821L9.18868 28.8576L7.8929 29.6132ZM44.8481 51.2515C35.4071 56.6471 24 54.2567 19.2913 46.1821L17.9955 46.9377C23.206 55.8729 35.5966 58.2666 45.5924 52.5538L44.8481 51.2515ZM53.1889 26.8242C57.8939 34.8925 54.2867 45.8572 44.8481 51.2515L45.5924 52.5538C55.5905 46.8398 59.6989 35.0102 54.4847 26.0686L53.1889 26.8242ZM39.133 39.9752C36.9079 36.1594 38.5861 30.8933 43.1656 28.2761L42.4213 26.9737C37.2824 29.9107 35.1028 36.0417 37.8373 40.7308L39.133 39.9752Z" fill="white" />
                        </svg>
                        <div className="stage_info">
                            <Text big={"1.Знакомство"} size_b={"18px"} small={"знакомство с заказчиком"} size_s={"16px"} />

                        </div>
                    </div>

                    <div className="stage">
                        <svg width="64" height="65" viewBox="0 0 64 65" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M48.4801 21.9991L49.7159 20.7632C51.7635 18.7156 55.0834 18.7156 57.131 20.7632C59.1786 22.8108 59.1786 26.1307 57.131 28.1783L55.8951 29.4141M48.4801 21.9991C48.4801 21.9991 48.6346 24.6252 50.9518 26.9424C53.269 29.2596 55.8951 29.4141 55.8951 29.4141M48.4801 21.9991L37.1184 33.3607C36.3489 34.1303 35.9641 34.5151 35.6332 34.9393C35.2428 35.4398 34.9082 35.9813 34.6351 36.5542C34.4036 37.0399 34.2316 37.5562 33.8874 38.5886L32.7856 41.8942L32.4291 42.9636M55.8951 29.4141L44.5335 40.7758C43.7639 41.5453 43.3791 41.9301 42.9549 42.261C42.4544 42.6514 41.9129 42.986 41.34 43.2591C40.8543 43.4906 40.338 43.6626 39.3056 44.0068L36 45.1086L34.9306 45.4651M34.9306 45.4651L33.8611 45.8216C33.353 45.991 32.7929 45.8587 32.4142 45.48C32.0355 45.1013 31.9032 44.5412 32.0726 44.0331L32.4291 42.9636M34.9306 45.4651L32.4291 42.9636" stroke="white" stroke-width="1.5" />
                            <path d="M21.3335 35.2275H28.0002" stroke="#3C8AFF" stroke-width="1.5" stroke-linecap="round" />
                            <path d="M21.3335 24.5605H38.6668" stroke="#3C8AFF" stroke-width="1.5" stroke-linecap="round" />
                            <path d="M21.3335 45.8936H25.3335" stroke="#3C8AFF" stroke-width="1.5" stroke-linecap="round" />
                            <path opacity="0.5" d="M8 27.2269C8 17.1703 8 12.1419 11.1242 9.01775C14.2484 5.89355 19.2767 5.89355 29.3333 5.89355H34.6667C44.7233 5.89355 49.7516 5.89355 52.8758 9.01775C56 12.1419 56 17.1703 56 27.2269V37.8936C56 47.9502 56 52.9785 52.8758 56.1027C49.7516 59.2269 44.7233 59.2269 34.6667 59.2269H29.3333C19.2767 59.2269 14.2484 59.2269 11.1242 56.1027C8 52.9785 8 47.9502 8 37.8936V27.2269Z" stroke="white" stroke-width="1.5" />
                        </svg>
                        <div className="stage_info">
                            <Text big={"2.Договор"} size_b={"18px"} small={"легкий и прозрачный"} size_s={"16px"} />
                        </div>
                    </div>

                    <div className="stage">
                        <svg width="64" height="65" viewBox="0 0 64 65" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M42 23.5605L42.474 24.0753C46.158 28.0753 48 30.0753 48 32.5605C48 35.0458 46.158 37.0458 42.474 41.0458L42 41.5605" stroke="#3C8AFF" stroke-width="1.5" stroke-linecap="round" />
                            <path d="M35.7183 18.5605L31.9994 32.4396L28.2805 46.3186" stroke="white" stroke-width="1.5" />
                            <path d="M22 23.5605L21.526 24.0753C17.842 28.0753 16 30.0753 16 32.5605C16 35.0458 17.842 37.0458 21.526 41.0458L22 41.5605" stroke="#3C8AFF" stroke-width="1.5" stroke-linecap="round" />
                            <path opacity="0.5" d="M58.6668 28.5602V32.5602C58.6668 45.131 58.6668 51.4164 54.7616 55.3216C50.8563 59.2269 44.5709 59.2269 32.0002 59.2269C19.4294 59.2269 13.144 59.2269 9.23874 55.3216C5.3335 51.4164 5.3335 45.131 5.3335 32.5602C5.3335 19.9894 5.3335 13.704 9.23874 9.7988C13.144 5.89355 19.4294 5.89355 32.0002 5.89355H36.0002" stroke="white" stroke-width="1.5" stroke-linecap="round" />
                        </svg>
                        <div className="stage_info">
                            <Text big={"3.Разработка"} size_b={"18px"} small={"от сбора тз до тестирования"} size_s={"16px"} />
                        </div>
                    </div>

                    <div className="stage">
                        <svg width="64" height="65" viewBox="0 0 64 65" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M10.699 42.5923L15.2043 29.0763C17.247 22.9482 18.2684 19.8841 20.6851 19.3136C23.1018 18.7431 25.3856 21.0269 29.9532 25.5946L38.9639 34.6052C43.5315 39.1728 45.8153 41.4567 45.2448 43.8734C44.6743 46.29 41.6102 47.3114 35.4821 49.3541L21.9661 53.8594C14.5917 56.3176 10.9045 57.5466 8.95814 55.6003C7.01179 53.6539 8.24087 49.9667 10.699 42.5923Z" stroke="white" stroke-width="1.5" stroke-linecap="round" />
                            <path opacity="0.5" d="M32.6272 49.484C32.6272 49.484 30.6054 43.401 30.6054 39.375C30.6054 35.3491 32.6272 29.2661 32.6272 29.2661M21.5073 52.5167C21.5073 52.5167 19.7997 45.1784 19.4855 40.3859C18.9663 32.468 21.5073 20.168 21.5073 20.168" stroke="white" stroke-width="1.5" stroke-linecap="round" />
                            <path d="M38.6914 27.2431L39.0754 25.3233C39.4631 23.3849 40.8597 21.8028 42.735 21.1777C44.6103 20.5526 46.007 18.9705 46.3946 17.0321L46.7786 15.1123" stroke="#3C8AFF" stroke-width="1.5" stroke-linecap="round" />
                            <path d="M46.8516 35.9031L47.4192 36.2308C49.1715 37.2425 51.3746 37.0194 52.8885 35.6769C54.2594 34.4612 56.2118 34.1529 57.8906 34.887L58.6679 35.2268" stroke="#3C8AFF" stroke-width="1.5" stroke-linecap="round" />
                            <path d="M26.1203 7.97129C25.2204 9.44344 25.4459 11.3405 26.666 12.5605L26.927 12.8216C27.9755 13.87 28.3621 15.4102 27.933 16.8295" stroke="#3C8AFF" stroke-width="1.5" stroke-linecap="round" />
                            <g opacity="0.5">
                                <path d="M18.4736 11.0693C19.0322 10.5107 19.9379 10.5107 20.4964 11.0693C21.055 11.6279 21.055 12.5336 20.4964 13.0921C19.9379 13.6507 19.0322 13.6507 18.4736 13.0921C17.915 12.5336 17.915 11.6279 18.4736 11.0693Z" fill="white" />
                            </g>
                            <g opacity="0.5">
                                <path d="M32.4189 19.6465C32.9775 19.0879 33.8832 19.0879 34.4417 19.6465C35.0003 20.2051 35.0003 21.1107 34.4417 21.6693C33.8832 22.2279 32.9775 22.2279 32.4189 21.6693C31.8604 21.1107 31.8604 20.2051 32.4189 19.6465Z" fill="white" />
                            </g>
                            <g opacity="0.5">
                                <path d="M45.7524 27.6465C46.311 27.0879 47.2167 27.0879 47.7752 27.6465C48.3338 28.2051 48.3338 29.1107 47.7752 29.6693C47.2167 30.2279 46.311 30.2279 45.7524 29.6693C45.1939 29.1107 45.1939 28.2051 45.7524 27.6465Z" fill="white" />
                            </g>
                            <path opacity="0.5" d="M50.8218 41.3965C51.3804 40.8379 52.286 40.8379 52.8446 41.3965C53.4032 41.9551 53.4032 42.8607 52.8446 43.4193C52.286 43.9779 51.3804 43.9779 50.8218 43.4193C50.2632 42.8607 50.2632 41.9551 50.8218 41.3965Z" fill="white" />
                            <path d="M51.1261 28.1019L50.6408 28.222L50.7132 28.5148L51.006 28.5873L51.1261 28.1019ZM56.0008 23.2272L55.5008 23.2259C55.5005 23.3589 55.5532 23.4867 55.6473 23.5808C55.7414 23.6749 55.8691 23.7276 56.0021 23.7272L56.0008 23.2272ZM51.1261 28.1019C51.6115 27.9818 51.6115 27.9819 51.6115 27.9819C51.6115 27.9819 51.6115 27.982 51.6115 27.9819C51.6115 27.9819 51.6115 27.9818 51.6114 27.9816C51.6113 27.9812 51.6112 27.9806 51.6109 27.9796C51.6104 27.9776 51.6097 27.9744 51.6086 27.97C51.6065 27.9613 51.6033 27.9477 51.5991 27.9297C51.5906 27.8936 51.5783 27.8395 51.5631 27.7695C51.5326 27.6294 51.4907 27.426 51.4458 27.1758C51.3557 26.6744 51.2543 25.9904 51.2072 25.2554C51.16 24.5173 51.1688 23.7457 51.2902 23.0628C51.413 22.3724 51.6409 21.8293 51.9844 21.4857L51.2773 20.7786C50.7272 21.3288 50.4451 22.1037 50.3057 22.8877C50.1649 23.6791 50.1593 24.5383 50.2092 25.3193C50.2594 26.1032 50.367 26.8265 50.4615 27.3527C50.5089 27.6163 50.5532 27.8317 50.5859 27.982C50.6023 28.0572 50.6157 28.1162 50.6252 28.1569C50.63 28.1772 50.6337 28.193 50.6364 28.204C50.6377 28.2094 50.6387 28.2137 50.6395 28.2167C50.6398 28.2182 50.6401 28.2194 50.6403 28.2203C50.6404 28.2208 50.6405 28.2211 50.6406 28.2214C50.6406 28.2216 50.6407 28.2217 50.6407 28.2218C50.6407 28.2219 50.6408 28.222 51.1261 28.1019ZM51.9844 21.4857C52.8187 20.6514 53.6948 20.5415 54.319 20.8299C54.9509 21.1218 55.5043 21.9045 55.5008 23.2259L56.5008 23.2285C56.5051 21.633 55.8201 20.4217 54.7383 19.922C53.6489 19.4188 52.336 19.7199 51.2773 20.7786L51.9844 21.4857ZM51.1261 28.1019C51.006 28.5873 51.0061 28.5873 51.0062 28.5873C51.0063 28.5873 51.0065 28.5874 51.0066 28.5874C51.0069 28.5875 51.0073 28.5876 51.0077 28.5877C51.0086 28.5879 51.0098 28.5882 51.0113 28.5886C51.0143 28.5893 51.0186 28.5903 51.0241 28.5917C51.035 28.5943 51.0508 28.5981 51.0711 28.6028C51.1118 28.6123 51.1708 28.6258 51.246 28.6421C51.3963 28.6748 51.6117 28.7192 51.8754 28.7665C52.4015 28.8611 53.1248 28.9686 53.9088 29.0188C54.6897 29.0688 55.5489 29.0631 56.3403 28.9224C57.1243 28.7829 57.8992 28.5009 58.4494 27.9507L57.7423 27.2436C57.3988 27.5871 56.8556 27.815 56.1652 27.9378C55.4823 28.0593 54.7107 28.0681 53.9726 28.0208C53.2376 27.9738 52.5536 27.8724 52.0522 27.7823C51.802 27.7373 51.5986 27.6954 51.4586 27.665C51.3886 27.6497 51.3345 27.6374 51.2984 27.629C51.2803 27.6247 51.2668 27.6215 51.258 27.6194C51.2536 27.6184 51.2504 27.6176 51.2484 27.6171C51.2475 27.6169 51.2468 27.6167 51.2464 27.6166C51.2462 27.6166 51.2461 27.6165 51.2461 27.6165C51.2461 27.6165 51.2461 27.6165 51.2461 27.6165C51.2462 27.6165 51.2462 27.6166 51.1261 28.1019ZM58.4494 27.9507C59.5081 26.892 59.8092 25.5791 59.306 24.4897C58.8063 23.408 57.5951 22.723 55.9995 22.7272L56.0021 23.7272C57.3235 23.7237 58.1063 24.2771 58.3982 24.909C58.6865 25.5333 58.5766 26.4093 57.7423 27.2436L58.4494 27.9507Z" fill="#3C8AFF" />
                            <path opacity="0.5" d="M40.5021 9.67384L40.4285 9.9328C40.3477 10.2172 40.3073 10.3595 40.3264 10.4991C40.3455 10.6387 40.422 10.7599 40.575 11.0023L40.7142 11.223C41.2525 12.0762 41.5217 12.5027 41.3383 12.8516C41.1549 13.2005 40.6405 13.2407 39.6116 13.321L39.3454 13.3418C39.053 13.3646 38.9068 13.376 38.779 13.4432C38.6512 13.5104 38.5563 13.6257 38.3664 13.8563L38.1935 14.0663C37.5252 14.878 37.1911 15.2838 36.8099 15.2317C36.4288 15.1795 36.2531 14.7038 35.9016 13.7525L35.8107 13.5064C35.7108 13.2361 35.6609 13.1009 35.5627 13.0028C35.4646 12.9047 35.3295 12.8548 35.0591 12.7549L34.813 12.6639C33.8617 12.3125 33.3861 12.1367 33.3339 11.7556C33.2817 11.3745 33.6875 11.0403 34.4992 10.3721L34.7092 10.1992C34.9399 10.0093 35.0552 9.91432 35.1224 9.78652C35.1895 9.65871 35.2009 9.51252 35.2238 9.22014L35.2446 8.95395C35.3249 7.92505 35.3651 7.41061 35.7139 7.22723C36.0628 7.04386 36.4894 7.31301 37.3425 7.8513L37.5632 7.99057C37.8056 8.14353 37.9268 8.22001 38.0665 8.23913C38.2061 8.25825 38.3483 8.21784 38.6327 8.13701L38.8917 8.06343C39.8927 7.779 40.3931 7.63679 40.6609 7.9046C40.9288 8.17241 40.7865 8.67289 40.5021 9.67384Z" stroke="#3C8AFF" />
                        </svg>
                        <div className="stage_info">
                            <Text big={"4.Релиз"} size_b={"18px"} small={"пьем шампанское"} size_s={"16px"} />
                        </div>
                    </div>

                    <div className="stage">
                        <svg xmlns="http://www.w3.org/2000/svg" width="64" height="65" viewBox="0 0 64 65" fill="none">
                            <path d="M5.3335 47.2272C5.3335 44.7349 5.3335 43.4888 5.86939 42.5605C6.22047 41.9525 6.72542 41.4475 7.3335 41.0964C8.2617 40.5605 9.50785 40.5605 12.0002 40.5605C14.4925 40.5605 15.7386 40.5605 16.6668 41.0964C17.2749 41.4475 17.7799 41.9525 18.1309 42.5605C18.6668 43.4888 18.6668 44.7349 18.6668 47.2272C18.6668 49.7195 18.6668 50.9657 18.1309 51.8939C17.7799 52.502 17.2749 53.0069 16.6668 53.358C15.7386 53.8939 14.4925 53.8939 12.0002 53.8939C9.50785 53.8939 8.2617 53.8939 7.3335 53.358C6.72542 53.0069 6.22047 52.502 5.86939 51.8939C5.3335 50.9657 5.3335 49.7195 5.3335 47.2272Z" stroke="white" stroke-width="1.5" stroke-linecap="round" />
                            <path opacity="0.5" d="M25.3335 47.2272C25.3335 44.7349 25.3335 43.4888 25.8694 42.5605C26.2205 41.9525 26.7254 41.4475 27.3335 41.0964C28.2617 40.5605 29.5079 40.5605 32.0002 40.5605C34.4925 40.5605 35.7386 40.5605 36.6668 41.0964C37.2749 41.4475 37.7799 41.9525 38.1309 42.5605C38.6668 43.4888 38.6668 44.7349 38.6668 47.2272C38.6668 49.7195 38.6668 50.9657 38.1309 51.8939C37.7799 52.502 37.2749 53.0069 36.6668 53.358C35.7386 53.8939 34.4925 53.8939 32.0002 53.8939C29.5079 53.8939 28.2617 53.8939 27.3335 53.358C26.7254 53.0069 26.2205 52.502 25.8694 51.8939C25.3335 50.9657 25.3335 49.7195 25.3335 47.2272Z" stroke="#3C8AFF" />
                            <path d="M45.3335 47.2272C45.3335 44.7349 45.3335 43.4888 45.8694 42.5605C46.2205 41.9525 46.7254 41.4475 47.3335 41.0964C48.2617 40.5605 49.5079 40.5605 52.0002 40.5605C54.4925 40.5605 55.7386 40.5605 56.6668 41.0964C57.2749 41.4475 57.7799 41.9525 58.1309 42.5605C58.6668 43.4888 58.6668 44.7349 58.6668 47.2272C58.6668 49.7195 58.6668 50.9657 58.1309 51.8939C57.7799 52.502 57.2749 53.0069 56.6668 53.358C55.7386 53.8939 54.4925 53.8939 52.0002 53.8939C49.5079 53.8939 48.2617 53.8939 47.3335 53.358C46.7254 53.0069 46.2205 52.502 45.8694 51.8939C45.3335 50.9657 45.3335 49.7195 45.3335 47.2272Z" stroke="#3C8AFF" stroke-width="1.5" stroke-linecap="round" />
                            <path d="M12 40.5609V24.5609C12 18.2755 12 15.1328 13.9526 13.1802C15.9052 11.2275 19.0479 11.2275 25.3333 11.2275H38.6667C44.9521 11.2275 48.0948 11.2275 50.0474 13.1802C52 15.1328 52 18.2755 52 24.5609V32.5609M52 32.5609L57.3333 27.2275M52 32.5609L46.6667 27.2275" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                        </svg>
                        <div className="stage_info">
                            <Text big={"5.Сопровождение"} size_b={"18px"} small={"помощь на любом этапе"} size_s={"16px"} />
                        </div>
                    </div>
                </div>
            </div>
            <div className="portfolio block">
                <p className="title">Портфолио</p>
                <p className="title_text">это наши работы, мы любим когда вы их смотрите, что бы узнать нас получше!</p>
                <div className="portfolio_projects">
                    <Project img={project_UFEX} name="UFEx" link="" link_name="ufex.pro" link_text="Сервис финансовых услуг" />
                    <Project img={project_FinMarket} name="FinMarket.pro" link="" link_name="finmarket.pro" link_text="Аукцион финансовых услуг" />
                    <Project img={project_DropShop} name="DropShop" link="" link_name="dropshop.games" link_text="Marketplace игровых ценностей" />
                    <Project img={project_LeKover} name="" link="" link_name="lekover.ru" link_text="Ковры ручной работы" />
                    <Project img={project_Poteryashka} name="" link="" link_name="poteryashka.com" link_text="Поиск пропавших вещей, животных." />
                </div>
            </div>
            <div className="team block">
                <p className="title">Наша команда</p>
                <p className="title_text">опытные, креативные и энергичные + кот.</p>
                <div className="team_people">
                    <div className="human">
                        <div className="avatar" >
                            <div className="fortest"></div>
                            <img id="fortest" src={avatar_bob228} alt="avatar" />
                        </div>
                        <Text big={"Dmitry Kazmirchuk"} size_b={"20px"} gap={"5px"} small={"CEO"} size_s={"18px"} />
                    </div>
                    <div className="human">
                        <div className="avatar" >
                            <img src={avatar_evenych} alt="avatar" />
                        </div>
                        <Text big={"Aleksey Khlopitski"} size_b={"20px"} gap={"5px"} small={"Tech lead"} size_s={"18px"} />
                    </div>
                    <div className="human">
                        <div className="avatar" >
                            <img src={avatar_booker} alt="avatar" />
                        </div>
                        <Text big={"Aleksandr Evenko"} size_b={"20px"} gap={"5px"} small={"Digital Designer"} size_s={"18px"} />
                    </div>
                    <div className="human">
                        <div className="avatar" >
                            <img src={avatar_trex} alt="avatar" />
                        </div>
                        <Text big={"Pasha Grudinsky"} size_b={"20px"} gap={"5px"} small={"Backend Developer"} size_s={"18px"} />
                    </div>
                    <div className="human">
                        <div className="avatar" >
                            <img src={avatar_rose} alt="avatar" />
                        </div>
                        <Text big={"Egor"} size_b={"20px"} gap={"5px"} small={"Frontend Developer"} size_s={"18px"} />
                    </div>
                </div>
            </div>
            <div className="feedback block">
                <img src={feedback_img1} alt="" id="feedback_img1" />
                <p className="title">Обратная связь</p>
                <p className="title_text ">Оставьте контакты и наш менеджер свяжется с вами.</p>
                <div className="inputs start">
                    <form id="contactForm">
                        <input type="text" name="name" id="input_name" placeholder="Имя" required />
                        <input type="email" name="email" id="input_email" placeholder="Email" required />
                        <input type="text" name="phone" id="input_phone" placeholder="Телефон" required />
                        <button id="white_button" className="big_button" onClick={() => {
                            const name = document.getElementById('input_name').value;
                            const email = document.getElementById('input_email').value;
                            const phone = document.getElementById('input_phone').value;

                            // Создаем объект с данными
                            const formData = {
                                name: name,
                                email: email,
                                phone: phone
                            }

                            console.log(formData)
                            fetch('/submit_form', {
                                method: 'POST',
                                headers: {
                                    'Content-Type': 'application/json'
                                },
                                body: JSON.stringify(formData)
                            })
                                .then(response => response.json())
                                .then(data => {
                                    if (data.success) {
                                        alert('Форма успешно отправлена!');
                                        // Можете добавить код для очистки формы или других дополнительных действий.
                                    } else {
                                        alert('Произошла ошибка при отправке формы.');
                                    }
                                })
                                .catch(error => console.error('Ошибка:', error));}}>
                            Отправить
                            </button>
                    </form>
                </div>
                <img src={feedback_img2} alt="" id="feedback_img2" />
            </div>
            <div className="faq block">
                <p className="title start">FAQ</p>
                <p className="title_text start">часто задаваемые вопросы</p>
                <div className="quastions">
                    <FaqBlock quastion={"Что включает в себя ваша услуга по разработке программного обеспечения?"}
                        answer={"Наша услуга охватывает весь цикл разработки программного обеспечения: от концептуализации и планирования до проектирования, кодирования, тестирования и поддержки. Мы используем современные технологии и методологии разработки, чтобы обеспечить эффективность и надежность наших решений."}
                    />
                    <FaqBlock quastion={"Каковы этапы разработки приложений нейронных сетей?"}
                        answer={"Наша услуга охватывает весь цикл разработки программного обеспечения: от концептуализации и планирования до проектирования, кодирования, тестирования и поддержки. Мы используем современные технологии и методологии разработки, чтобы обеспечить эффективность и надежность наших решений."}
                    />
                    <FaqBlock quastion={"Какие типы проектов в области Digital вы реализуете?"}
                        answer={"Наша услуга охватывает весь цикл разработки программного обеспечения: от концептуализации и планирования до проектирования, кодирования, тестирования и поддержки. Мы используем современные технологии и методологии разработки, чтобы обеспечить эффективность и надежность наших решений."}
                    />
                    <FaqBlock quastion={"Каковы ваши цены и условия оплаты?"}
                        answer={"Наша услуга охватывает весь цикл разработки программного обеспечения: от концептуализации и планирования до проектирования, кодирования, тестирования и поддержки. Мы используем современные технологии и методологии разработки, чтобы обеспечить эффективность и надежность наших решений."}
                    />
                    <FaqBlock quastion={"Как вы обеспечиваете безопасность и конфиденциальность данных?"}
                        answer={"Наша услуга охватывает весь цикл разработки программного обеспечения: от концептуализации и планирования до проектирования, кодирования, тестирования и поддержки. Мы используем современные технологии и методологии разработки, чтобы обеспечить эффективность и надежность наших решений."}
                    />
                </div>

            </div>

            <Lights />
        </div>
    )
}

export default Content;